app/Controllers/Admin.php

    public function index()
    {
        $data = [
            'hero' => $this->heroModel->first(),
            'partners' => $this->partnerModel->findAll(),
            'programs' => $this->programModel->findAll(),
            'achievements' => $this->achievementModel->orderBy('year', 'DESC')->findAll(),
            'gallery' => $this->galleryModel->findAll(),
            'divisions' => $this->divisionModel->findAll(),
---
SELECT *
FROM `cms_partners`
SELECT *
FROM `cms_programs`
SELECT *
FROM `cms_achievements`
ORDER BY `year` DESC
SELECT *
FROM `cms_gallery`
SELECT *
FROM `cms_divisions`

    public function addDivision()
    {
        if (!$this->validate([
            'name' => 'required',
            'color' => 'required',
            'division_image' => [
                'rules' => 'uploaded[division_image]|max_size[division_image,1024]|is_image[division_image]|mime_in[division_image,image/jpg,image/jpeg,image/png]',
                'errors' => [
                    'uploaded' => 'Logo divisi wajib diupload.',
                    'max_size' => 'Ukuran terlalu besar (max 1MB).',
                    'is_image' => 'File bukan gambar.',
                ]
            ]
        ])) {
            return redirect()->to('/admin')->withInput()->with('validation', \Config\Services::validation());
        }

        $file = $this->request->getFile('division_image');
        $path = $this->uploadImage($file, '/divisi');

        $colorClass = 'bg-white text-gray-800'; // Default
        $selectedColor = $this->request->getPost('color');

        if ($selectedColor == 'blue') {
            $colorClass = 'bg-blue-500 text-white';
        } elseif ($selectedColor == 'red') {
            $colorClass = 'bg-red-500 text-white';
        }

        $this->divisionModel->save([
            'name' => $this->request->getPost('name'),
            'description' => $this->request->getPost('description'),
            'image_path' => $path,
            'color_class' => $colorClass
        ]);
---
INSERT INTO `cms_divisions` (`name`, `description`, `image_path`, `color_class`) VALUES ('Medicom', 'Medicom', '/src/img/divisi/Group_280.png', 'bg-white text-gray-800')

    public function deleteDivision($id)
    {
        $item = $this->divisionModel->find($id);
        if ($item) {
            if ($item['image_path'] && file_exists(FCPATH . $item['image_path'])) {
                unlink(FCPATH . $item['image_path']);
            }
            $this->divisionModel->delete($id);
---
SELECT *
FROM `cms_divisions`
WHERE `cms_divisions`.`id` = '8'
DELETE FROM `cms_divisions`
WHERE `id` IN ('8')

    public function addProgram()
    {
        // Validasi Input
        if (!$this->validate([
            'title' => 'required',
            'description' => 'required',
            'program_image' => [
                'rules' => 'uploaded[program_image]|max_size[program_image,2048]|is_image[program_image]|mime_in[program_image,image/jpg,image/jpeg,image/png]',
                'errors' => [
                    'uploaded' => 'Gambar program wajib diupload.',
                    'max_size' => 'Ukuran gambar terlalu besar (maks 2MB).',
                    'is_image' => 'File bukan gambar.',
                    'mime_in' => 'Format harus JPG/PNG.'
                ]
            ]
        ])) {
            return redirect()->to('/admin')->withInput()->with('validation', \Config\Services::validation());
        }

        $file = $this->request->getFile('program_image');
        // Simpan di folder khusus 'programs' biar rapi
        $path = $this->uploadImage($file, '/programs');

        $this->programModel->save([
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'image_path' => $path
        ]);
---
INSERT INTO `cms_programs` (`title`, `description`, `image_path`) VALUES ('Merancang prototipe kamera', 'prototipe kamera sony', '/src/img/programs/HEADER LINKEDIN.png')