app/Controllers/Home.php

SELECT *
FROM `cms_partners`
SELECT *
FROM `cms_programs`
SELECT *
FROM `cms_gallery`
SELECT *
FROM `cms_divisions`
SELECT *
FROM `cms_achievements`
ORDER BY `year` DESC
---
    public function index() {
        $heroModel        = new HeroModel();
        $partnerModel     = new PartnerModel();
        $programModel     = new ProgramModel();
        $achievementModel = new AchievementModel();
        $galleryModel     = new GalleryModel();
        $divisionModel    = new DivisionModel();

        $data = [
            'hero'       => $heroModel->first(),
            'partners'   => $partnerModel->findAll(),
            'programs'   => $programModel->findAll(),
            'gallery'    => $galleryModel->findAll(),
            'divisions' => $divisionModel->findAll(),

            // sorting by terbaru
            'achievements_by_year' => $achievementModel->orderBy('year', 'DESC')->findAll(),