app/Controllers/MainUsers.php

    public function index()
    {
        $heroModel = new HeroModel();
        $partnerModel = new PartnerModel();
        $programModel = new ProgramModel();
        $achievementModel = new AchievementModel();
        $galleryModel = new GalleryModel();
        $divisionModel = new DivisionModel();

        $data = [
            'hero' => $heroModel->first(),
            'partners' => $partnerModel->findAll(),
            'programs' => $programModel->findAll(),
            'gallery' => $galleryModel->findAll(),
            'divisions' => $divisionModel->findAll(),
            'achievements_by_year' => $achievementModel->orderBy('year', 'DESC')->findAll(),
        ];
---
SELECT *
FROM `cms_achievements`
ORDER BY `year` DESC
SELECT *
FROM `cms_partners`
SELECT *
FROM `cms_programs`
SELECT *
FROM `cms_gallery`
SELECT *
FROM `cms_divisions`

    public function about()
    {
        $pageModel = new PageModel();
        $objectiveModel = new ObjectiveModel();

        $data = [
            'page' => $pageModel->find('about'),
            'objectives' => $objectiveModel->findAll(),
        ];
---
SELECT *
FROM `cms_objectives`

    public function pengurus()
    {
        $divModel = new DivisionModel();
        $memModel = new MemberModel();

        $data = [
            'divisions' => $divModel->findAll(),
            'members' => $memModel->findAll()
        ];
---
SELECT *
FROM `cms_members`
SELECT *
FROM `cms_divisions`